{
  "podcasts": [{
      "title": "Playing Catch Up",
      "date": "6/6/2019",
      "summary": "A lot can happen in two weeks! We talk about Ryan's staycation and Erik's trip to The Bahamas. Then, we catch up with The NBA Finals and share our prediction of who will win. MLB draft results are next, specifically with what the Detroit Tigers did. Lastly, the NFL OTAs have started and that has us excited for football, so we try to figure out the intriguing NFC North.",
      "src": "https://s3.us-east-2.amazonaws.com/78percentsports/podcast_6_6_2019.mp3",
      "music": {
        "artist": "Aussens@iter",
        "song": "May"
      }
    },{
      "title": "Game of Thrones Series Finale",
      "date": "5/23/2019",
      "summary": "Ryan liked the Game of Thrones series finale. Erik absolutely hated it. We discuss all of the things that happened in the final episode and the final season as a whole. Erik then offers up some alternate endings that are far superior to the one revealed this past Sunday night. A must listen for any Game of Thrones fan!",
      "src": "https://s3.us-east-2.amazonaws.com/78percentsports/podcast_5_23_2019.mp3",
      "music": {
        "artist": "Kevin MacLeod",
        "song": "Beach Party"
      }
    },{
      "title": "Chiarelli's Market",
      "date": "5/16/2019",
      "summary": "We both worked our first jobs and met at a small meat market in Lincoln Park named Chiarelli's Market, roughly 20 years ago. This podcast is dedicated to the absolute nonsense that happened there leading to us becoming best friends. If anyone named Chiarelli listens to this, we want to apologize in advance!",
      "src": "https://s3.us-east-2.amazonaws.com/78percentsports/podcast_5_16_2019.mp3",
      "music": {
        "artist": "Hans Atom",
        "song": "Who'll play the Blues?"
      }
    },{
      "title": "GOATs & Busts",
      "date": "5/9/2019",
      "summary": "This episode is all about the GOATs, the Greatest Of All Time in each sport. We talk about their incredible accomplishments, insane records, and why they are the best ever at their respective sport. Then we talk about the complete opposite end of the spectrum, the worst Busts of all time. They are guys who were highly thought of that failed to live up to expectations and had disastrous careers.",
      "src": "https://s3.us-east-2.amazonaws.com/78percentsports/podcast_5_9_2019.mp3",
      "music": {
        "artist": "grapes",
        "song": "I dunno"
      }
    },{
      "title": "2019 NFL Draft Results & The Battle of Winterfell",
      "date": "5/2/2019",
      "summary": "The NFL Draft has come and gone, so it's time to discuss yet again how badly the Detroit Lions screwed this one up. We talk about the other NFL teams as well, mainly the ones that had the most interesting drafts and admire how real, competent franchises operate. Then we discuss the mind blowing episode of Game of Thrones that contained the long-awaited Battle of Winterfell.",
      "src": "https://s3.us-east-2.amazonaws.com/78percentsports/podcast_5_2_2019.mp3",
      "music": {
        "artist": "Stefan Kartenberg",
        "song": "The Vendetta"
      }
    },{
      "title": "April Check-In",
      "date": "4/25/2019",
      "summary": "April is possibly the busiest month of the year when it comes to sports, so we check in with each league to see what's going on. For the NBA, we talk about the Detroit Pistons getting swept. The NHL, we talk about Steve Yzerman's return to Detroit. We give our early impressions on the young MLB season. Then, we add a few last minute thoughts on the NFL draft. A great episode for fans of all sports!",
      "src": "https://s3.us-east-2.amazonaws.com/78percentsports/podcast_4_25_2019.mp3",
      "music": {
        "artist": "Broke For Free",
        "song": "Hella"
      }
    },{
    "title": "NFL Mock Draft 2019",
    "date": "4/18/2019",
    "summary": "Each of us did our own mock drafts for next week's NFL Draft. In this week's episode, we compare our results. Who goes number one overall? Who do the Detroit Lions take? What do the Oakland Raiders do with three first round picks? Tune in to find out!",
    "src": "https://s3.us-east-2.amazonaws.com/78percentsports/podcast_4_18_2019.mp3",
    "music": {
      "artist": "BOPD",
      "song": "6.6.05"
    }
  },{
    "title": "Game of Thrones & Sports Hodgepodge",
    "date": "4/11/2019",
    "summary": "With the Game of Thrones final season premiere airing this Sunday, we give our predictions for what will happen and who will end up claiming the iron throne when all is said and done. Sports Hodgepodge comes next with a bunch of random, quick topics occuring recently in the world of sports.",
    "src": "https://s3.us-east-2.amazonaws.com/78percentsports/podcast_4_11_2019.mp3",
    "music": {
      "artist": "Mid-Air Machine",
      "song": "Knowing Nothing"
    }
  },{
    "title": "20 Questions",
    "date": "4/4/2019",
    "summary": "We ask each other 20 of the most ridiculous, random, stupid, idiotic questions you could think of with a few sports questions thrown in to break up the total nonsense.",
    "src": "https://s3.us-east-2.amazonaws.com/78percentsports/podcast_4_4_2019.mp3",
    "music": {
      "artist": "The Insider",
      "song": "The Insider Theme"
    }
  },{
    "title": "2019 MLB Season Predictions",
    "date": "3/28/2019",
    "summary": "It's Opening Day 2019! In a baseball heavy episode, we predict the following for the American and National leagues: division winners, wild card teams, league winner, Cy Young winner, and MVP. The World Series winner is saved for last. Baseball is back!",
    "src": "https://s3.us-east-2.amazonaws.com/78percentsports/podcast_3_28_2019.mp3",
    "music": {
      "artist": "Mid-Air Machine",
      "song": "Appalachian Coal Mines"
    }
  },{
    "title": "NFL Free Agency & March Madness",
    "date": "3/21/2019",
    "summary": "Now that the dust has settled upon this year's NFL free agency, we break down the notable moves throughout the league. Also, get some last minute March Madness bracket advice as we reveal our Final Four teams and NCAA champion for 2019.",
    "src": "https://s3.us-east-2.amazonaws.com/78percentsports/podcast_3_21_2019.mp3",
    "music": {
      "artist": "Jahzzar",
      "song": "Magic Mountain"
    }
  },{
    "title": "Our First Guest",
    "date": "3/14/2019",
    "summary": "Our first guest, Chris Sollars, joins us as we share some great stories, ranging from something that happened 10 minutes before the show to way back in high school. Get to know us better and gear up for some big laughs. No sports. All nonsense.",
    "src": "https://s3.us-east-2.amazonaws.com/78percentsports/podcast_3_14_2019.mp3",
    "music": {
      "artist": "Jason Shaw",
      "song": "South of the Border"
    }
  },
    {
    "title": "Fantasy Baseball Sleepers & Keepers",
    "date": "3/7/2019",
    "summary": "Another new segment - \"Sleepers & Keepers.\" We give you two \"Sleepers\" from each position in baseball ranked outside of the top 10 that will have excellent years and help deliver your fantasy team a championship. A \"Keeper\" is a guy under the age of 25 that you'll want on your team for years to come. Take notes as we recommend one for each position.",
    "src": "https://s3.us-east-2.amazonaws.com/78percentsports/podcast_3_7_2019.mp3",
    "music": {
      "artist": "Tri-Tachyon",
      "song": "Hundred Years in Helheim"
    }
  }, {
    "title": "Contenders, Pretenders, Studs & Duds",
    "date": "2/28/2019",
    "summary": "Two new segments get introduced to the show - \"Contender or Pretender?\" and \"Studs & Duds.\" If the NBA playoffs started today, we determine which teams would be real contenders for the championship or phony pretenders. Studs & Duds involves us examining the top 10 fantasy baseball players at each position and determining a \"Stud\" who will have a great year and a \"Dud\" who will have a terrible year. And of course, a hilarious final question. Enjoy!",
    "src": "https://s3.us-east-2.amazonaws.com/78percentsports/podcast_2_28_2019.mp3",
    "music": {
      "artist": "BOPD",
      "song": "6.6.05"
    }
  }, {
    "title": "Podcast #1",
    "date": "2/21/2019",
    "summary": "Our first podcast! We talk about what to expect on the show now and in the future. Then, we give fantasy baseball draft advice: What to watch out for, tips & tricks, what not to do, and more. Lastly, we discuss the potential MLB rule changes for the upcoming season and beyond.",
    "src": "https://s3.us-east-2.amazonaws.com/78percentsports/podcast_2_21_2019.mp3",
    "music": {
      "artist": "Black Ant",
      "song": "5 Piece"
    }
  }]
}
